{
  "base_model_name_or_path": "/root/autodl-tmp/qwen2_5_7b_model",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 16,
  "lora_dropout": 0.0,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "q_proj",
    "down_proj",
    "o_proj",
    "gate_proj",
    "v_proj",
    "k_proj",
    "up_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}